import { useContext } from 'react';
import './PrivacyPage.css';
import { LanguageContext } from '../context/LanguageContext';

const PrivacyContent = ({ language }) => {
  if (language === 'ja') {
    return (
      <>
        <h1>MICHIKI 個人情報保護方針</h1>
        <p className="notice">※ 本個人情報保護方針はポートフォリオ目的で作成された架空の文書であり、実際のユーザーの個人情報を収集または第三者に提供せず、いかなる法的効力も持ちません。</p>
        <h2>第1条 (収集する個人情報の項目)</h2>
        <p>本サービスは会員登録および円滑な顧客相談、各種サービスの提供のために以下の最小限の個人情報を収集しています。(例: メールアドレス, ニックネーム)</p>
        <h2>第2条 (個人情報の収集および利用目的)</h2>
        <p>サービスは、以下の目的のために個人情報を収集および利用します。</p>
        <ol>
            <li>会員の識別および管理</li>
            <li>サービスの提供および機能改善</li>
            <li>お問い合わせへの対応および告知事項の伝達</li>
        </ol>
        <h2>第3条 (個人情報の保有および利用期間)</h2>
        <p>サービスは、原則として個人情報の収集および利用目的が達成された後は、当該情報を遅滞なく破棄します。ただし、関係法令の規定により保存する必要がある場合、法令で定められた一定期間、会員情報を保管します。</p>
        <h2>第4条 (利用者の権利およびその行使方法)</h2>
        <p>利用者は、いつでも登録されている自身の個人情報を照会または修正することができ、アカウントの削除を要請することもできます。「会員退会」機能を通じて本人確認手続きを経た後、直接退会が可能です。</p>
        <h2>第5条 (個人情報自動収集装置の設置・運営およびその拒否に関する事項)</h2>
        <p>本サービスは利用者のクッキー(cookie)を収集しないなど、自動的に収集される個人情報はありません。</p>
        <hr />
        <p><strong>附則</strong></p>
        <p>本個人情報保護方針は2025年7月23日から施行されます。</p>
      </>
    );
  }
  return (
    <>
      <h1>MICHIKI <br/> 개인정보 처리방침</h1>
      <p className="notice">※ 본 개인정보 처리방침은 포트폴리오 목적으로 작성된 가상의 문서이며, 실제 사용자의 개인정보를 수집하거나 제3자에게 제공하지 않으며, 어떠한 법적 효력도 갖지 않습니다.</p>
      <h2>제1조 (수집하는 개인정보의 항목)</h2>
      <p>본 서비스는 회원가입 및 원활한 고객 상담, 각종 서비스의 제공을 위해 아래와 같은 최소한의 개인정보를 수집하고 있습니다. (예: 이메일, 닉네임)</p>
      <h2>제2조 (개인정보의 수집 및 이용 목적)</h2>
      <p>서비스는 다음의 목적을 위해 개인정보를 수집 및 이용합니다.</p>
      <ol>
        <li>회원 식별 및 관리</li>
        <li>서비스 제공 및 기능 개선</li>
        <li>문의사항 응대 및 고지사항 전달</li>
      </ol>
      <h2>제3조 (개인정보의 보유 및 이용기간)</h2>
      <p>서비스는 원칙적으로 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를 지체 없이 파기합니다. 단, 관계법령의 규정에 의하여 보존할 필요가 있는 경우, 법령에서 정한 일정한 기간 동안 회원정보를 보관합니다.</p>
      <h2>제4조 (이용자의 권리 및 행사방법)</h2>
      <p>이용자는 언제든지 등록되어 있는 자신의 개인정보를 조회하거나 수정할 수 있으며, 계정 삭제를 요청할 수도 있습니다. '회원탈퇴' 기능을 통해 본인 확인 절차를 거친 후 직접 탈퇴가 가능합니다.</p>
      <h2>제5조 (개인정보 자동 수집 장치의 설치·운영 및 거부에 관한 사항)</h2>
      <p>본 서비스는 이용자의 쿠키(cookie)를 수집하지 않는 등, 자동으로 수집되는 개인정보는 없습니다.</p>
      <hr />
      <p><strong>부칙</strong></p>
      <p>본 개인정보 처리방침은 2025년 7월 23일부터 시행됩니다.</p>
    </>
  );
};

function PrivacyPage() {
  const { language } = useContext(LanguageContext);
  return (
    <div className="privacy-container">
      <PrivacyContent language={language} />
    </div>
  );
}

export default PrivacyPage;
