import { useContext } from 'react';
import './TermsPage.css';
import { LanguageContext } from '../context/LanguageContext';

const TermsContent = ({ language }) => {
  if (language === 'ja') {
    return (
      <>
        <h1>[Michiki] サービス利用規約</h1>
        <p className="notice">※ 本利用規約はポートフォリオ目的で作成された架空の文書であり、いかなる法的効力も持ちません。</p>
        <h2>第1条 (目的)</h2>
        <p>本規約は[Michiki](以下「サービス」)の利用に関して、サービスと会員間の権利、義務および責任事項、その他必要な事項を規定することを目的とします。</p>
        <h2>第2条 (会員登録)</h2>
        <p>利用者は、本規約に同意した後、サービスが定める様式に従って会員登録を申請し、サービスがこれを承認することで会員になることができます。</p>
        <h2>第3条 (サービスの提供および変更)</h2>
        <p>サービスは、会員に安定的なサービスを提供するために最善を尽くします。ただし、技術的な必要や運営上の判断により、サービスの内容が変更または中断されることがあります。</p>
        <h2>第4条 (会員の義務)</h2>
        <p>会員は、本規約および関係法令を遵守しなければならず、サービスの運営を妨害する行為をしてはなりません。また、虚偽の情報で登録したり、他人の情報を盗用してはなりません。</p>
        <h2>第5条 (契約解除および利用制限)</h2>
        <p>会員は、いつでもサービスからの退会を要請することができます。会員が本規約に違反した場合、サービスは事前の通知なしに会員資格を制限または剥奪することができます。</p>
        <hr />
        <p><strong>附則</strong></p>
        <p>本規約は2025年7月23日から施行されます。</p>
      </>
    );
  }
  return (
    <>
      <h1>[Michiki] <br/> 이용약관</h1>
      <p className="notice">※ 본 이용약관은 포트폴리오 목적으로 작성된 가상의 문서이며, 어떠한 법적 효력도 갖지 않습니다.</p>
      <h2>제1조 (목적)</h2>
      <p>본 약관은 [Michiki](이하 '서비스')의 이용과 관련하여 서비스와 <br /> 회원 간의 권리, 의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다.</p>
      <h2>제2조 (회원가입)</h2>
      <p>이용자는 본 약관에 동의한 후, <br /> 서비스가 정한 양식에 따라 회원가입을 신청하고 서비스가 이를 승낙함으로써 회원이 될 수 있습니다.</p>
      <h2>제3조 (서비스의 제공 및 변경)</h2>
      <p>서비스는 회원에게 안정적인 서비스를 제공하기 위해 최선을 다합니다. <br />다만, 기술적인 필요나 운영상의 판단에 따라 서비스의 내용이 변경되거나 중단될 수 있습니다.</p>
      <h2>제4조 (회원의 의무)</h2>
      <p>회원은 본 약관 및 관계 법령을 준수해야 하며, 서비스의 운영을 방해하는 행위를 해서는 안 됩니다. <br /> 또한, 허위 정보로 가입하거나 타인의 정보를 도용해서는 안 됩니다.</p>
      <h2>제5조 (계약 해지 및 이용 제한)</h2>
      <p>회원은 언제든지 서비스 탈퇴를 요청할 수 있습니다. <br /> 회원이 본 약관을 위반할 경우, 서비스는 사전 통보 없이 회원 자격을 제한하거나 박탈할 수 있습니다.</p>
      <hr />
      <p><strong>부칙</strong></p>
      <p>본 약관은 2025년 7월 23일부터 시행됩니다.</p>
    </>
  );
};

function TermsPage() {
  const { language } = useContext(LanguageContext);
  return (
    <div className="terms-container">
      <TermsContent language={language} />
    </div>
  );
}

export default TermsPage;
