import React from 'react';

export const texts = {
  ko: {
    catchphrase: '함께 계획해서 더 완벽한 여행,',
    startNow: '지금 시작하세요!',
    login: '구글로 시작하기',
    language: 'Language',
    korean: '한국어',
    japanese: '日本語',

    // 이용약관, 개인정보 텍스트
    termsContent : () => (
      <>
     <h1> [Michiki] <br/> 서비스 이용약관</h1>
            <p className = "notice">
                ※ 본 이용약관은 포트폴리오 목적으로 작성된 가상의 문서이며, 어떠한 법적 효력을 갖지 않습니다.
            </p>

            <h2>제1조 (목적)</h2>
            <p> 본 약관은 [프로젝트 이름](이하 '서비스')의 이용과 관련하여 서비스와 <br />
            회원 간의 권리, 의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다.
            </p>

            <h2>제2조 (용어의 정의)</h2>
            <p> 본 약관에서 사용하는 용어의 정의는 다음과 같습니다. <br />
            1. '서비스'라 함은 Michiki이 제공하는 모든 기능을 의미합니다. <br />
            2. '회원'이라 함은 서비스에 접속하여 본 약관에 따라 이용 계약을 채결하고 서비스를 이용하는 고객을 말합니다
            </p>
            
            <h2>제3조 (회원의 의무)</h2>
            <p> 회원은 다음 행위를 하여서는 안 됩니다. <br />
            1. 타인의 정보 도용 <br />
            2. 서비스 운영을 고의로 방해하는 행위 <br />
            3. 공서양속에 위반되는 부정한 내용의 정보 등을 고개 또는 게시하는 행위 
            </p>
            
            <h2>제4조 (서비스의 제공 및 변경)</h2>
            <p>
            1. 서비스는 연중무휴, 1일 24시간 제공함을 원칙으로 합니다. <br />
            2. 회사는 상당한 이유가 있는 경우에 운영상, 기술상의 필요에 따라 제공하고 있는 <br />
            전부 또는 일부 서비스를 변경할 수 있습니다.
            </p>
            
            <h2>제5조 (면책 조항)</h2>
            <p> 회사는 천재지변 또는 이에 준하는 불가항력으로 인하여 <br />
            서비스를 제공할 수 없는 경우에는 서비스 제공에 관한 책임이 면제됩니다.
            </p>
            
            <hr />
            <p><strong>부칙</strong></p>
            <p>본 약관은 2025년 07월 10일부터 시행됩니다.</p>
      </>
    ),
    privacyContent : () => (
      <>
        <h1> MICHIKI <br /> 개인정보 처리방침 </h1>
            <p className = "notice">
                ※ 본 개인정보 처리방침은 포트폴리오 목적으로 작성된 가상의 문서이며, 실제 사용자의 개인정보를 수집하거나 제3자에게 제공하지 않으며, 어떠한 법적 효력도 갖지 않습니다.
            </p>
    
            <h2> 제1조 (수집하는 개인정보의 항목) </h2>
            <p> 본 서비스는 회원가입 및 원활한 고객 상담, 각종 서비스의 제공을 위해 아래와 같은 최소한의 개인정보를 수집하고 있습니다.</p>
            <ul>
                <li> 필수 항목 : 구글 소셜로그인 </li>
                <li> 선택 항목 : - </li>
            </ul>
    
            <h2> 제2조 (개인정보의 수집 및 이용목적) </h2>
            <p> 본 서비스는 수집한 개인정보를 다음의 목적으로 활용합니다. </p>
            <ul>
                <li> 회원 관리 : 회원제 서비스 이용에 따른 본인확인, 개인 식별</li>
                <li> 서비스 제공 : 콘텐츠 제공, 맞춤 서비스 제공 </li>
            </ul>
    
            <h2> 제3조 (개인정보의 보유 및 이용기간) </h2>
            <p> 원칙적으로, 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를 지체 없이 파기합니다. 단, 회원의 동의 하에 정보를 보유하며, 회원 탈퇴를 요청할 경우 즉시 파기합니다. </p>
            
            <h2> 제4조 (개인정보 제3자 제공) </h2>
            <p> 본 서비스는 이용자의 개인정보를 원칙적으로 외부에 제공하지 않습니다. </p>
    
            <h2> 제5조 (이용자의 권리 및 행사방법) </h2>
            <p> 이용자는 언제든지 등록되어 있는 자신의 개인정보를 조회하거나 수정할 수 있으며, 가입해지를 요청할 수도 있습니다. </p>
    
            <h2> 제6조 (개인정보 관리 책임자) </h2>
            <p> 본 서비스는 이용자의 개인정보를 보호하고 개인정보와 관련한 불만을 처리하기 위해서 아래와 같이 관련 부서 및 개인정보 관리 책임자를 지정하고 있습니다. </p>
            <ul>
                <li> 담당자 : [MICHIKI] </li>
                <li> 이메일 : janny152@naver.com </li>
            </ul>
            <hr />
            <p><strong> 부칙 </strong></p>
            <p> 본 개인정보 처리방침은 2025년 7월 10일 부터 시행됩니다. </p>
      </>
    ),
  },
  ja: {
    catchphrase: '一緒に計画して、もっと完璧な旅行を',
    startNow: '今すぐ始めましょう！',
    login: 'Googleで始める',
    language: '言語',
    korean: '韓国語',
    japanese: '日本語',
    termsContent : () => (
      <>
        <h1> [Michiki] <br/> サービス利用規約</h1>
            <p className = "notice">
                ※ 本利用規約はポートフォリオ目的で作成された架空の文書であり、いかなる法的効力も持ちません。
            </p>

            <h2>第1条 (目的)</h2>
            <p> 本規約は[プロジェクト名](以下「サービス」)の利用に関して、サービスと会員間の権利、義務および責任事項、その他必要な事項を規定することを目的とします。</p>

            <h2>第2条 (用語の定義)</h2>
            <p> 本規約で使用する用語の定義は次のとおりです。<br />
            1. 「サービス」とはMichikiが提供するすべての機能を意味します。<br />
            2. 「会員」とはサービスにアクセスし、本規約に従って利用契約を締結し、サービスを利用する顧客を指します。</p>
            
            <h2>第3条 (会員の義務)</h2>
            <p> 会員は次の行為をしてはなりません。<br />
            1. 他人の情報を盗用する行為<br />
            2. サービス運営を故意に妨害する行為<br />
            3. 公序良俗に反する不正な内容の情報等を投稿または掲示する行為</p>
            
            <h2>第4条 (サービスの提供および変更)</h2>
            <p>
            1. サービスは年中無休、1日24時間提供することを原則とします。<br />
            2. 会社は相当な理由がある場合、運営上、技術上の必要に応じて提供している全てまたは一部のサービスを変更することができます。</p>
            
            <h2>第5条 (免責事項)</h2>
            <p> 会社は天災地変またはこれに準ずる不可抗力により、サービスを提供できない場合、サービス提供に関する責任を免れます。</p>
            </>
    ),
    privacyContent : () => (
      <>
        <h1> MICHIKI <br /> 個人情報保護方針 </h1>
            <p className = "notice">
                ※ 本個人情報保護方針はポートフォリオ目的で作成された架空の文書であり、実際のユーザーの個人情報を収集または第三者に提供せず、いかなる法的効力も持ちません。
            </p>
    
            <h2> 第1条 (収集する個人情報の項目) </h2>
            <p> 本サービスは会員登録および円滑な顧客相談、各種サービスの提供のために以下の最小限の個人情報を収集しています。</p>
            <ul>
                <li> 必須項目 : Googleソーシャルログイン </li>
                <li> 任意項目 : - </li>
            </ul>
    
            <h2> 第2条 (個人情報の収集および利用目的) </h2>
            <p> 本サービスは収集した個人情報を次の目的で活用します。 </p>
            <ul>
                <li> 会員管理 : 会員制サービス利用に伴う本人確認、個人識別</li>
                <li> サービス提供 : コンテンツ提供、カスタマイズサービス提供 </li>
            </ul>
    
            <h2> 第3条 (個人情報の保有および利用期間) </h2>
            <p> 原則として、個人情報収集および利用目的が達成された後は、該当情報を遅滞なく破棄します。ただし、会員の同意に基づき情報を保持し、会員退会を要求した場合は即座に破棄します。</p>
            
            <h2> 第4条 (個人情報第三者提供) </h2>
            <p> 本サービスは利用者の個人情報を原則として外部に提供しません。</p>
    
            <h2> 第5条 (利用者の権利および行使方法) </h2>
            <p> 利用者はいつでも登録されている自分の個人情報を照会または修正することができ、加入解約を要求することもできます。</p>
            
            <h2> 第6条 (個人情報管理責任者) </h2>
            <p> 本サービスは利用者の個人情報を保護し、個人情報に関する不満を処理するために、以下のように関連部署および個人情報管理責任者を指定しています。</p>
            <ul>
                <li> 担当者 : [MICHIKI] </li>
                <li> メール : janny152@naver.com </li>
            </ul>
            <hr />
            <p><strong> 付則 </strong></p>
            <p> 本個人情報保護方針は2025年7月10日から施行されます。 </p>
      </>
    ),
  },
};